import Foundation

struct CalendarConstants {

    static let calendarPrepositionalCase: Dictionary =
        [
            1: "январе",
            2: "феврале",
            3: "марте",
            4: "апреле",
            5: "мае",
            6: "июне",
            7: "июле",
            8: "августе",
            9: "сентябре",
            10: "октябре",
            11: "ноябре",
            12: "декабре",
        ]

    static let calendarGenitiveCase: Dictionary =
        [
            1: "января",
            2: "февраля",
            3: "марта",
            4: "апреля",
            5: "мая",
            6: "июня",
            7: "июля",
            8: "августа",
            9: "сентября",
            10: "октября",
            11: "ноября",
            12: "декабря",
            13: "января",
        ]
    
    static let calendarNominativeCase: Dictionary =
    [
        1: "январь",
        2: "февраль",
        3: "март",
        4: "апрель",
        5: "май",
        6: "июнь",
        7: "июль",
        8: "август",
        9: "сентябрь",
        10: "октябрь",
        11: "ноябрь",
        12: "декабрь"
    ]
}
